gojimmypi/wolfssl-examples/ESP32/benchmark/components/wolfssl/wolfcrypt/src/sha256.c
    #define WC_SHA256_DIGEST_WORD_SIZE 16
    #define XTRANSFORM(S, D) wc_Sha256SCE_XTRANSFORM((S), (D))
    static int wc_Sha256SCE_XTRANSFORM(wc_Sha256* sha256, const byte* data)
    {
        if (WOLFSSL_SCE_GSCE_HANDLE.p_cfg->endian_flag ==
                CRYPTO_WORD_ENDIAN_LITTLE)
        {
            ByteReverseWords((word32*)data, (word32*)data,
                    WC_SHA256_BLOCK_SIZE);
            ByteReverseWords(sha256->digest, sha256->digest,
                    WC_SHA256_DIGEST_SIZE);
        }

        if (WOLFSSL_SCE_SHA256_HANDLE.p_api->hashUpdate(
                    WOLFSSL_SCE_SHA256_HANDLE.p_ctrl, (word32*)data,
                    WC_SHA256_DIGEST_WORD_SIZE, sha256->digest) != SSP_SUCCESS){
            WOLFSSL_MSG("Unexpected hardware return value");
            return WC_HW_E;
        }

        if (WOLFSSL_SCE_GSCE_HANDLE.p_cfg->endian_flag ==
                CRYPTO_WORD_ENDIAN_LITTLE)
        {
            ByteReverseWords((word32*)data, (word32*)data,
                    WC_SHA256_BLOCK_SIZE);
            ByteReverseWords(sha256->digest, sha256->digest,
                    WC_SHA256_DIGEST_SIZE);
        }

        return 0;
    }


    int wc_InitSha256_ex(wc_Sha256* sha256, void* heap, int devId)
    {
        int ret = 0;
        if (sha256 == NULL)
            return BAD_FUNC_ARG;

        sha256->heap = heap;

        ret = InitSha256(sha256);
        if (ret != 0)
            return ret;

        (void)devId;

        return ret;
    }

#elif defined(WOLFSSL_USE_ESP32WROOM32_CRYPT_HASH_HW)

    /* HW may fail since there's only one, so we still need SW */
    #define NEED_SOFT_SHA256

    /*
     * we'll set the digest at the last minute,
     *  just before computing hash.
     *
     * Reminder that ESP32-C3 does NOT need initial digest.
     **/
    int set_default_digest256(wc_Sha256* sha256)
    {
        if (sha256->ctx.isfirstblock == 1)
        {
            XMEMSET(sha256->digest, 0, sizeof(sha256->digest));
            if (sha256->ctx.mode == ESP32_SHA_SW) {
                sha256->digest[0] = 0x6A09E667L;
                sha256->digest[1] = 0xBB67AE85L;
                sha256->digest[2] = 0x3C6EF372L;
                sha256->digest[3] = 0xA54FF53AL;
                sha256->digest[4] = 0x510E527FL;
                sha256->digest[5] = 0x9B05688CL;
                sha256->digest[6] = 0x1F83D9ABL;
                sha256->digest[7] = 0x5BE0CD19L;
            }
        }
        return 0;
    }

    /*
     * this is a custom Espressif InitSha256 ()
     *
     * soft SHA needs initialization digest, but HW does not.
     *  we'll determine that later, just before performing cal
     */
    static int InitSha256(wc_Sha256* sha256)
    {
        int ret = 0; /* zero = success */
        ESP_LOGV(TAG, "entering InitSha256");

        if (sha256 == NULL)
            return BAD_FUNC_ARG;


        /* TODO see page 337 of C3 spec: 16.4.1.3 Setting the Initial Hash Value
         *
         * Before hash task begins for any secure hash algorithms, the initial Hash value H(0) must be set based on different
           algorithms. However, the SHA accelerator uses the initial Hash values (constant C) stored in the hardware for
           hash tasks
         * */


        sha256->buffLen = 0;
        sha256->loLen   = 0;
        sha256->hiLen   = 0;

        /* always start firstblock = 1 when using hw engine */
        sha256->ctx.isfirstblock = 1;
        sha256->ctx.sha_type = SHA2_256;

        /* if this sha256 already has HW set, we'll release it */
        if(sha256->ctx.mode == ESP32_SHA_HW) {
            /* release hw during init if we are doing init while in HW mode
             * TODO really ? what if BUSY elsewhere with SHA in progress?
             **/
            ESP_LOGV(TAG, "InitSha256; esp_sha_hw_unlock");
            esp_sha_hw_unlock(&(sha256->ctx));
        }

        /* always set mode as INIT
        *  whether using HW or SW is determined at first call of update()
        */
        sha256->ctx.mode = ESP32_SHA_INIT;
        ESP_LOGV("WOLF sha256", "exiting InitSha256; ESP32_SHA_INIT");

        return ret;
    }

    /*
     * wolfCrypt InitSha256 external wrapper
     *  we don't know if digest needed or not,
     *  so no digest is set here.
     */
    int wc_InitSha256_ex(wc_Sha256* sha256, void* heap, int devId)
    {
        int ret = 0; /* zero = success */

        if (sha256 == NULL)
            return BAD_FUNC_ARG;

        XMEMSET(sha256, 0, sizeof(wc_Sha256));
        sha256->ctx.mode = ESP32_SHA_INIT;
        sha256->ctx.isfirstblock = 1;
        sha256->ctx.lockDepth = 0; /* we'll keep track of our own lock depth */

        // TODO keep track of which digest is in progress.
        // useful for interleaving (e.g. ESP32-C3)
        // sha256->ctx.for_digest = &sha256->digest[0];
        (void)devId;

        ret = InitSha256(sha256);
        return ret;
    }

#elif defined(WOLFSSL_RENESAS_TSIP_CRYPT) && \
    !defined(NO_WOLFSSL_RENESAS_TSIP_CRYPT_HASH)

    /* implemented in wolfcrypt/src/port/Renesas/renesas_tsip_sha.c */

#elif defined(WOLFSSL_RENESAS_SCEPROTECT) && \
    !defined(NO_WOLFSSL_RENESAS_SCEPROTECT_HASH)

    /* implemented in wolfcrypt/src/port/Renesas/renesas_sce_sha.c */

#elif defined(WOLFSSL_PSOC6_CRYPTO)

    /* implemented in wolfcrypt/src/port/cypress/psoc6_crypto.c */

#elif defined(WOLFSSL_IMXRT_DCP)
    #include <wolfssl/wolfcrypt/port/nxp/dcp_port.h>
    /* implemented in wolfcrypt/src/port/nxp/dcp_port.c */

#elif defined(WOLFSSL_SILABS_SE_ACCEL)
    /* implemented in wolfcrypt/src/port/silabs/silabs_hash.c */

#elif defined(WOLFSSL_KCAPI_HASH)
    /* implemented in wolfcrypt/src/port/kcapi/kcapi_hash.c */

#elif defined(WOLFSSL_HAVE_PSA) && !defined(WOLFSSL_PSA_NO_HASH)
    /* implemented in wolfcrypt/src/port/psa/psa_hash.c */

#else
    #define NEED_SOFT_SHA256

    int wc_InitSha256_ex(wc_Sha256* sha256, void* heap, int devId)
    {
        int ret = 0;
        if (sha256 == NULL)
            return BAD_FUNC_ARG;
        ret = InitSha256(sha256);
        if (ret != 0)
            return ret;

